/******************************************************************************
 *																			  *
 *  FMCFRB LIBRARY SAMPLE PROGRAM 1											  *
 *																			  *
 *        TITLE    : ｷｰﾎﾞｰﾄﾞ入力   											  *
 *																			  *
 *        使用方法 : ｺﾏﾝﾄﾞﾓｰﾄﾞ上から run386 -nocrt fmc1    					  *
 *                   [終了] ESCｷｰを押す             	   					  *
 *																			  *
 *****************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "..\include\fmcfrb.h"

static char	*keytable[] = {	"","esc","1","2","3","4","5","6",	  /* 00～07 */
							"7","8","9","0","-","^","\\","後退",  /* 08～0F */
							"ﾀﾌﾞ","Q","W","E","R","T","Y","U",    /* 10～17 */
							"I","O","P","","[","ﾘﾀｰﾝ","A","S", 	  /* 18～1F */
							"D","F","G","H","J","K","L",";",	  /* 20～27 */
							":","]","Z","X","C","V","B","N",	  /* 28～2F */
							"M",",",".","/","`","ｽﾍﾟｰｽ","T*","T/",
								/* 30～37 */
							"T+","T-","T7","T8","T9","T=","T4","T5",
								/* 38～3F */
							"T6","","T1","T2","T3","Tﾘﾀｰﾝ","T0","T.",
								/* 40～47 */
							"挿入","","T000","削除","","↑","HOME","←",
								/* 48～4F */
							"↓","→","CTRL","SHIFT","","","","無変換",
								/* 50～57 */
							"変換","かな漢字","","PF12","","PF1","PF2","PF3",
								/* 58～5F */
							"PF4","PF5","PF6","PF7","PF8","PF9","PF10",
							"シフト左",					  /* 60～67 */
							"シフト右","PF11","英大","漢字辞書","単語抹消",
							"単語登録","前行","英小",	  /* 68～6F */
							"次行","半全角","取消","実行","PF13","PF14","PF15",
							"PF16",					 	  /* 70～77 */
							"PF17","PF18","PF19","PF20","BREAK","COPY","",""
														  /* 78～7F */
						};
void main()
{
	static char	matrix[16];
	static char	matrixa[16];
	int		i;
	int		bit;

	printf("何かキーを押して下さい．押されたキーを表示します．\n");
	printf("ESCキーを押すと終了します．\n");

	memset(matrixa, 0, 16);

	do{
		KYB_matrix(matrix);

		for (i = 0 ; i < 16 ; i++ ){
			matrixa[i] ^= matrix[i];

			for (bit = 0 ; bit < 8 ; bit++){
				if (matrixa[i] & (0x01 << bit)){

					if (matrix[i] & (0x01 << bit)){
						printf(" %s が押された\n",keytable[i*8 + bit]);
					}else{
						printf(" %s が離された\n",keytable[i*8 + bit]);
					}

				}
			}

			matrixa[i] = matrix[i];
		}

	} while((matrix[0] & 0x02) == 0);  /* エスケープキーが押されたら終わり*/

	KYB_clrbuf();

}
